OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148_features.h
/* FlexIO module features */

/* @brief Define the maximum number of shifters for any FlexIO instance. */
#    define FEATURE_FLEXIO_MAX_SHIFTER_COUNT (4U)
/* @brief Define DMA request names for Flexio. */
#    define FEATURE_FLEXIO_DMA_REQ_0 EDMA_REQ_FLEXIO_SHIFTER0
#    define FEATURE_FLEXIO_DMA_REQ_1 EDMA_REQ_FLEXIO_SHIFTER1
#    define FEATURE_FLEXIO_DMA_REQ_2 EDMA_REQ_FLEXIO_SHIFTER2_SAI1_RX
#    define FEATURE_FLEXIO_DMA_REQ_3 EDMA_REQ_FLEXIO_SHIFTER3_SAI1_TX

/* LPSPI module features */

/* @brief DMA instance used for LPSPI module */
#    define LPSPI_DMA_INSTANCE 0U

/* @brief DMA instance used for LPI2C module */
#    define LPI2C_DMA_INSTANCE 0U

/* PDB module features */

/* @brief Define the count of supporting ADC channels per each PDB. */
#    define FEATURE_PDB_ADC_CHANNEL_COUNT (4U)
/* @brief Define the count of supporting ADC pre-trigger for each channel. */
#    define FEATURE_PDB_ADC_PRE_CHANNEL_COUNT (8U)
/* @brief Define the count of supporting Pulse-Out outputs per each PDB. */
#    define FEATURE_PDB_PODLY_COUNT (1U)

/* Interrupt module features */

/* @brief Lowest interrupt request number. */
#    define FEATURE_INTERRUPT_IRQ_MIN (NonMaskableInt_IRQn)
/* @brief Highest interrupt request number. */
#    define FEATURE_INTERRUPT_IRQ_MAX (FTM3_Ovf_Reload_IRQn)
/**< Number of priority bits implemented in the NVIC */
#    define FEATURE_NVIC_PRIO_BITS (4U)
/* @brief Has software interrupt. */
#    define FEATURE_INTERRUPT_HAS_SOFTWARE_IRQ (0u)
/* @brief Has pending interrupt state. */
#    define FEATURE_INTERRUPT_HAS_PENDING_STATE (1u)
/* @brief Has active interrupt state. */
#    define FEATURE_INTERRUPT_HAS_ACTIVE_STATE (1u)

/* System Control Block module features */

/* @brief VECTKEY value so that AIRCR register write is not ignored. */
#    define FEATURE_SCB_VECTKEY (0x05FAU)

/* SMC module features */

/* @brief Has stop option (register bit STOPCTRL[STOPO]). */
#    define FEATURE_SMC_HAS_STOPO (1)
/* @brief Has partial stop option (register bit STOPCTRL[PSTOPO]). */
#    define FEATURE_SMC_HAS_PSTOPO (0)
/* @brief Has WAIT and VLPW options. */
#    define FEATURE_SMC_HAS_WAIT_VLPW (0)
/* @brief Has high speed run mode (register bit PMPROT[AHSRUN]). */
#    define FEATURE_SMC_HAS_HIGH_SPEED_RUN_MODE (1)

/* MPU module features */

/* @brief Has process identifier support. */
#    define FEATURE_MPU_HAS_PROCESS_IDENTIFIER (1U)
/* @brief Specifies total number of bus masters. */
#    define FEATURE_MPU_MASTER_COUNT (4U)
/* @brief Specifies maximum number of masters which have separated
privilege rights for user and supervisor mode accesses (e.g. master0~3 in S32K144).
*/
#    define FEATURE_MPU_MAX_LOW_MASTER_NUMBER (3U)
/* @brief Specifies maximum number of masters which have only
read and write permissions (e.g. master4~7 in S32K144).
*/
#    define FEATURE_MPU_MAX_HIGH_MASTER_NUMBER (7U)

/* @brief Specifies number of set access control right bits for
   masters which have separated privilege rights for user and
   supervisor mode accesses (e.g. master0~3 in S32K144).
*/
#    define FEATURE_MPU_LOW_MASTER_CONTROL_WIDTH (6U)
/* @brief Specifies number of set access control right bits for
   masters which have only read and write permissions(e.g. master4~7 in S32K144).
*/
#    define FEATURE_MPU_HIGH_MASTER_CONTROL_WIDTH (2U)

/* @brief The MPU Logical Bus Master Number for core bus master. */
#    define FEATURE_MPU_MASTER_CORE (0U)
/* @brief The MPU Logical Bus Master Number for Debugger master. */
#    define FEATURE_MPU_MASTER_DEBUGGER (1U)
/* @brief The MPU Logical Bus Master Number for DMA master. */
#    define FEATURE_MPU_MASTER_DMA (2U)
/* @brief The MPU Logical Bus Master Number for ENET master. */
#    define FEATURE_MPU_MASTER_ENET (3U)

/* @brief Specifies total number of slave ports. */
#    define FEATURE_MPU_SLAVE_COUNT (5U)
/* @brief The MPU Slave Port Assignment for Flash Controller and boot ROM. */
#    define FEATURE_MPU_SLAVE_FLASH_BOOTROM (0U)
/* @brief The MPU Slave Port Assignment for SRAM back door. */
#    define FEATURE_MPU_SLAVE_SRAM_BACKDOOR (1U)
/* @brief The MPU Slave Port Assignment for SRAM_L front door. */
#    define FEATURE_MPU_SLAVE_SRAM_L_FRONTDOOR (2U)
/* @brief The MPU Slave Port Assignment for SRAM_U front door. */
#    define FEATURE_MPU_SLAVE_SRAM_U_FRONTDOOR (3U)
/* @brief The MPU Slave Port Assignment for QuadSPI. */
#    define FEATURE_MPU_SLAVE_QUADSPI (4U)
/* @brief The MPU Slave Port mask. */
#    define FEATURE_MPU_SLAVE_MASK (0xF8000000U)

/* WDOG module features */

/* @brief The 32-bit value used for unlocking the WDOG. */
#    define FEATURE_WDOG_UNLOCK_VALUE (0xD928C520U)
/* @brief The 32-bit value used for resetting the WDOG counter. */
#    define FEATURE_WDOG_TRIGGER_VALUE (0xB480A602U)
/* @brief The reset value of the timeout register. */
#    define FEATURE_WDOG_TO_RESET_VALUE (0x400U)
/* @brief The value minimum of the timeout register. */
#    define FEATURE_WDOG_MINIMUM_TIMEOUT_VALUE (0x0U)
/* @brief The reset value of the window register. */
#    define FEATURE_WDOG_WIN_RESET_VALUE (0x0U)
/* @brief The mask of the reserved bit in the CS register. */
#    define FEATURE_WDOG_CS_RESERVED_MASK (0x2000U)
/* @brief The value used to set WDOG source clock from LPO. */
#    define FEATURE_WDOG_CLK_FROM_LPO (0x1UL)
/* @brief The first 16-bit value used for unlocking the WDOG. */
#    define FEATURE_WDOG_UNLOCK16_FIRST_VALUE (0xC520U)
/* @brief The second 16-bit value used for unlocking the WDOG. */
#    define FEATURE_WDOG_UNLOCK16_SECOND_VALUE (0xD928U)
/* @brief The first 16-bit value used for resetting the WDOG counter. */
#    define FEATURE_WDOG_TRIGGER16_FIRST_VALUE (0xA602U)
/* @brief The second 16-bit value used for resetting the WDOG counter. */
#    define FEATURE_WDOG_TRIGGER16_SECOND_VALUE (0xB480U)

/* EDMA module features */

/* @brief Number of EDMA channels. */
#    define FEATURE_EDMA_MODULE_CHANNELS (16U)
/* @brief Number of EDMA channel interrupt lines. */
#    define FEATURE_CHANNEL_INTERRUPT_LINES (16U)
/* @brief Number of EDMA error interrupt lines. */
#    define FEATURE_ERROR_INTERRUPT_LINES (1U)
/* @brief eDMA module has error interrupt. */
#    define FEATURE_EDMA_HAS_ERROR_IRQ
/* @brief eDMA module has separate interrupt lines for each channel. */
#    define FEATURE_EDMA_SEPARATE_IRQ_LINES_PER_CHN
/* @brief Conversion from channel index to DCHPRI index. */
#    define FEATURE_EDMA_CHN_TO_DCHPRI_INDEX(x) ((x) ^ 3U)
/* @brief eDMA channel groups count. */
#    define FEATURE_EDMA_CHANNEL_GROUP_COUNT (1U)
/* @brief Number of eDMA channels with asynchronous request capability. */
#    define FEATURE_EDMA_ASYNCHRO_REQUEST_CHANNEL_COUNT (16U)
/* @brief Clock names for eDMA. */
#    define EDMA_CLOCK_NAMES \
        {                    \
            SIM_DMA_CLK      \
        }

/* DMAMUX module features */

/* @brief Number of DMA channels. */
#    define FEATURE_DMAMUX_MODULE_CHANNELS (16U)
/* @brief Has the periodic trigger capability */
#    define FEATURE_DMAMUX_HAS_TRIG (1)
/* @brief Conversion from request source to the actual DMAMUX channel */
#    define FEATURE_DMAMUX_REQ_SRC_TO_CHN(x) (x)
/* @brief Mapping between request source and DMAMUX instance */
#    define FEATURE_DMAMUX_REQ_SRC_TO_INSTANCE(x) (0U)
/* @brief Conversion from eDMA channel index to DMAMUX channel. */
#    define FEATURE_DMAMUX_CHN_FOR_EDMA_CHN(x) (x)
/* @brief Conversion from DMAMUX channel DMAMUX register index. */
#    define FEATURE_DMAMUX_CHN_REG_INDEX(x) (x)
/* @brief Clock names for DMAMUX. */
#    define DMAMUX_CLOCK_NAMES \
        {                      \
            DMAMUX0_CLK        \
        }
/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */

