OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148_features.h
typedef enum
{
    EDMA_REQ_DISABLED                = 0U,
    ENET_MAC0_TIMER_OR_CH0_CH3       = 1U,
    EDMA_REQ_LPUART0_RX              = 2U,
    EDMA_REQ_LPUART0_TX              = 3U,
    EDMA_REQ_LPUART1_RX              = 4U,
    EDMA_REQ_LPUART1_TX              = 5U,
    EDMA_REQ_LPUART2_RX              = 6U,
    EDMA_REQ_LPUART2_TX              = 7U,
    EDMA_REQ_LPI2C1_RX               = 8U,
    EDMA_REQ_LPI2C1_TX               = 9U,
    EDMA_REQ_FLEXIO_SHIFTER0         = 10U,
    EDMA_REQ_FLEXIO_SHIFTER1         = 11U,
    EDMA_REQ_FLEXIO_SHIFTER2_SAI1_RX = 12U,
    EDMA_REQ_FLEXIO_SHIFTER3_SAI1_TX = 13U,
    EDMA_REQ_LPSPI0_RX               = 14U,
    EDMA_REQ_LPSPI0_TX               = 15U,
    EDMA_REQ_LPSPI1_RX               = 16U,
    EDMA_REQ_LPSPI1_TX               = 17U,
    EDMA_REQ_LPSPI2_RX               = 18U,
    EDMA_REQ_LPSPI2_TX               = 19U,
    EDMA_REQ_FTM1_CHANNEL_0          = 20U,
    EDMA_REQ_FTM1_CHANNEL_1          = 21U,
    EDMA_REQ_FTM1_CHANNEL_2          = 22U,
    EDMA_REQ_FTM1_CHANNEL_3          = 23U,
    EDMA_REQ_FTM1_CHANNEL_4          = 24U,
    EDMA_REQ_FTM1_CHANNEL_5          = 25U,
    EDMA_REQ_FTM1_CHANNEL_6          = 26U,
    EDMA_REQ_FTM1_CHANNEL_7          = 27U,
    EDMA_REQ_FTM2_CHANNEL_0          = 28U,
    EDMA_REQ_FTM2_CHANNEL_1          = 29U,
    EDMA_REQ_FTM2_CHANNEL_2          = 30U,
    EDMA_REQ_FTM2_CHANNEL_3          = 31U,
    EDMA_REQ_FTM2_CHANNEL_4          = 32U,
    EDMA_REQ_FTM2_CHANNEL_5          = 33U,
    EDMA_REQ_FTM2_CHANNEL_6          = 34U,
    EDMA_REQ_FTM2_CHANNEL_7          = 35U,
    EDMA_REQ_FTM0_OR_CH0_CH7         = 36U,
    EDMA_REQ_FTM3_OR_CH0_CH7         = 37U,
    EDMA_REQ_FTM4_OR_CH0_CH7         = 38U,
    EDMA_REQ_FTM5_OR_CH0_CH7         = 39U,
    EDMA_REQ_FTM6_OR_CH0_CH7         = 40U,
    EDMA_REQ_FTM7_OR_CH0_CH7         = 41U,
    EDMA_REQ_ADC0                    = 42U,
    EDMA_REQ_ADC1                    = 43U,
    EDMA_REQ_LPI2C0_RX               = 44U,
    EDMA_REQ_LPI2C0_TX               = 45U,
    EDMA_REQ_PDB0                    = 46U,
    EDMA_REQ_PDB1                    = 47U,
    EDMA_REQ_CMP0                    = 48U,
    EDMA_REQ_PORTA                   = 49U,
    EDMA_REQ_PORTB                   = 50U,
    EDMA_REQ_PORTC                   = 51U,
    EDMA_REQ_PORTD                   = 52U,
    EDMA_REQ_PORTE                   = 53U,
    EDMA_REQ_FLEXCAN0                = 54U,
    EDMA_REQ_FLEXCAN1                = 55U,
    EDMA_REQ_FLEXCAN2                = 56U,
    EDMA_REQ_SAI0_RX                 = 57U,
    EDMA_REQ_SAI0_TX                 = 58U,
    EDMA_REQ_LPTMR0                  = 59U,
    EDMA_REQ_QUADSPI_RX              = 60U,
    EDMA_REQ_QUADSPI_TX              = 61U,
    EDMA_REQ_DMAMUX_ALWAYS_ENABLED0  = 62U,
    EDMA_REQ_DMAMUX_ALWAYS_ENABLED1  = 63U
} dma_request_source_t;

/* LPI2C module features */

/* @brief Disable high-speed and ultra-fast operating modes for S32K144. */
#    define LPI2C_HAS_FAST_PLUS_MODE (0U)
#    define LPI2C_HAS_HIGH_SPEED_MODE (0U)
#    define LPI2C_HAS_ULTRA_FAST_MODE (0U)

/* FTM module features */
/* @brief Number of PWM channels */
#    define FEATURE_FTM_CHANNEL_COUNT (8U)
/* @brief Number of fault channels */
#    define FTM_FEATURE_FAULT_CHANNELS (4U)
/* @brief Width of control channel */
#    define FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH (8U)
/* @brief Output channel offset */
#    define FTM_FEATURE_OUTPUT_CHANNEL_OFFSET (16U)
/* @brief Max counter value */
#    define FTM_FEATURE_CNT_MAX_VALUE_U32 (0x0000FFFFU)
/* @brief Input capture for single shot */
#    define FTM_FEATURE_INPUT_CAPTURE_SINGLE_SHOT (2U)
/* @brief Dithering has supported on the generated PWM signals */
#    define FEATURE_FTM_HAS_SUPPORTED_DITHERING (1U)

/* EWM module features */

/* @brief First byte of the EWM Service key        */
#    define FEATURE_EWM_KEY_FIRST_BYTE (0xB4U)
/* @brief Second byte of the EWM Service key       */
#    define FEATURE_EWM_KEY_SECOND_BYTE (0x2CU)
/* @brief EWM Compare High register maximum value  */
#    define FEATURE_EWM_CMPH_MAX_VALUE (0xFEU)
/* @brief EWM Compare Low register minimum value  */
#    define FEATURE_EWM_CMPL_MIN_VALUE (0x00U)

/* CLOCK names */

/*! @brief Clock names. */
typedef enum
{

    /* Main clocks */
    CORE_CLK   = 0u, /*!< Core clock                     */
    BUS_CLK    = 1u, /*!< Bus clock                      */
    SLOW_CLK   = 2u, /*!< Slow clock                     */
    CLKOUT_CLK = 3u, /*!< CLKOUT clock                   */

    /* Other internal clocks used by peripherals. */
    SIRC_CLK          = 4u,  /*!< SIRC clock                     */
    FIRC_CLK          = 5u,  /*!< FIRC clock                     */
    SOSC_CLK          = 6u,  /*!< SOSC clock                     */
    SPLL_CLK          = 7u,  /*!< SPLL clock                     */
    RTC_CLKIN_CLK     = 8u,  /*!< RTC_CLKIN clock                */
    SCG_CLKOUT_CLK    = 9u,  /*!< SCG CLK_OUT clock              */
    SIRCDIV1_CLK      = 10u, /*!< SIRCDIV1 functional clock      */
    SIRCDIV2_CLK      = 11u, /*!< SIRCDIV2 functional clock      */
    FIRCDIV1_CLK      = 12u, /*!< FIRCDIV1 functional clock      */
    FIRCDIV2_CLK      = 13u, /*!< FIRCDIV2 functional clock      */
    SOSCDIV1_CLK      = 14u, /*!< SOSCDIV1 functional clock      */
    SOSCDIV2_CLK      = 15u, /*!< SOSCDIV2 functional clock      */
    SPLLDIV1_CLK      = 16u, /*!< SPLLDIV1 functional clock      */
    SPLLDIV2_CLK      = 17u, /*!< SPLLDIV2 functional clock      */
    SCG_END_OF_CLOCKS = 18u, /*!< End of SCG clocks              */

    /* SIM clocks */
    SIM_FTM0_CLOCKSEL = 21u, /*!< FTM0 External Clock Pin Select */
    SIM_FTM1_CLOCKSEL = 22u, /*!< FTM1 External Clock Pin Select */
    SIM_FTM2_CLOCKSEL = 23u, /*!< FTM2 External Clock Pin Select */
    SIM_FTM3_CLOCKSEL = 24u, /*!< FTM3 External Clock Pin Select */
    SIM_FTM4_CLOCKSEL = 25u, /*!< FTM4 External Clock Pin Select */
    SIM_FTM5_CLOCKSEL = 26u, /*!< FTM5 External Clock Pin Select */
    SIM_FTM6_CLOCKSEL = 27u, /*!< FTM6 External Clock Pin Select */
    SIM_FTM7_CLOCKSEL = 28u, /*!< FTM7 External Clock Pin Select */
    SIM_CLKOUTSELL    = 29u, /*!< CLKOUT Select                  */
    SIM_RTCCLK_CLK    = 30u, /*!< RTCCLK clock                   */
    SIM_LPO_CLK       = 31u, /*!< LPO clock                      */
    SIM_LPO_1K_CLK    = 32u, /*!< LPO 1KHz clock                 */
    SIM_LPO_32K_CLK   = 33u, /*!< LPO 32KHz clock                */
    SIM_LPO_128K_CLK  = 34u, /*!< LPO 128KHz clock               */
    SIM_EIM_CLK       = 35u, /*!< EIM clock source               */
    SIM_ERM_CLK       = 36u, /*!< ERM clock source               */
    SIM_DMA_CLK       = 37u, /*!< DMA clock source               */
    SIM_MPU_CLK       = 38u, /*!< MPU clock source               */
    SIM_MSCM_CLK      = 39u, /*!< MSCM clock source              */
    SIM_END_OF_CLOCKS = 40u, /*!< End of SIM clocks              */

    /* PCC clocks */
    CMP0_CLK                      = 41u, /*!< CMP0 clock source              */
    CRC0_CLK                      = 42u, /*!< CRC0 clock source              */
    DMAMUX0_CLK                   = 43u, /*!< DMAMUX0 clock source           */
    EWM0_CLK                      = 44u, /*!< EWM0 clock source              */
    PORTA_CLK                     = 45u, /*!< PORTA clock source             */
    PORTB_CLK                     = 46u, /*!< PORTB clock source             */
    PORTC_CLK                     = 47u, /*!< PORTC clock source             */
    PORTD_CLK                     = 48u, /*!< PORTD clock source             */
    PORTE_CLK                     = 49u, /*!< PORTE clock source             */
    RTC0_CLK                      = 50u, /*!< RTC0 clock source              */
    SAI0_CLK                      = 51u, /*!< SAI0 clock source              */
    SAI1_CLK                      = 52u, /*!< SAI1 clock source              */
    PCC_END_OF_BUS_CLOCKS         = 53u, /*!< End of BUS clocks              */
    FlexCAN0_CLK                  = 54u, /*!< FlexCAN0 clock source          */
    FlexCAN1_CLK                  = 55u, /*!< FlexCAN1 clock source          */
    FlexCAN2_CLK                  = 56u, /*!< FlexCAN2 clock source          */
    PDB0_CLK                      = 57u, /*!< PDB0 clock source              */
    PDB1_CLK                      = 58u, /*!< PDB1 clock source              */
    PCC_END_OF_SYS_CLOCKS         = 59u, /*!< End of SYS clocks              */
    FTFC0_CLK                     = 60u, /*!< FTFC0 clock source             */
    PCC_END_OF_SLOW_CLOCKS        = 61u, /*!< End of SLOW clocks             */
    ENET0_CLK                     = 62u, /*!< ENET0 clock source             */
    FTM0_CLK                      = 63u, /*!< FTM0 clock source              */
    FTM1_CLK                      = 64u, /*!< FTM1 clock source              */
    FTM2_CLK                      = 65u, /*!< FTM2 clock source              */
    FTM3_CLK                      = 66u, /*!< FTM3 clock source              */
    FTM4_CLK                      = 67u, /*!< FTM4 0 clock source            */
    FTM5_CLK                      = 68u, /*!< FTM5 0 clock source            */
    FTM6_CLK                      = 69u, /*!< FTM6 0 clock source            */
    FTM7_CLK                      = 70u, /*!< FTM7 clock source              */
    PCC_END_OF_ASYNCH_DIV1_CLOCKS = 71u, /*!< End of ASYNCH DIV1 clocks      */
    ADC0_CLK                      = 72u, /*!< ADC0 clock source              */
    ADC1_CLK                      = 73u, /*!< ADC1 clock source              */
    FLEXIO0_CLK                   = 74u, /*!< FLEXIO0 clock source           */
    LPI2C0_CLK                    = 75u, /*!< LPI2C0 clock source            */
    LPI2C1_CLK                    = 76u, /*!< LPI2C1 clock source            */
    LPIT0_CLK                     = 77u, /*!< LPIT0 clock source             */
    LPSPI0_CLK                    = 78u, /*!< LPSPI0 clock source            */
    LPSPI1_CLK                    = 79u, /*!< LPSPI1 clock source            */
    LPSPI2_CLK                    = 80u, /*!< LPSPI2 clock source            */
    LPTMR0_CLK                    = 81u, /*!< LPTMR0 clock source            */
    LPUART0_CLK                   = 82u, /*!< LPUART0 clock source           */
    LPUART1_CLK                   = 83u, /*!< LPUART1 clock source           */
    LPUART2_CLK                   = 84u, /*!< LPUART2 clock source           */
    QSPI0_CLK                     = 85u, /*!< QSPI0 clock source             */
    PCC_END_OF_ASYNCH_DIV2_CLOCKS = 86u, /*!< End of ASYNCH DIV2 clocks      */
    PCC_END_OF_CLOCKS             = 87u, /*!< End of PCC clocks              */
    CLOCK_NAME_COUNT              = 88u, /*!< The total number of entries    */
} clock_names_t;

#    define PCC_INVALID_INDEX 0

/*! @brief PCC clock name mappings
 *  Mappings between clock names and peripheral clock control indexes.
 *  If there is no peripheral clock control index for a clock name,
 *  then the corresponding value is PCC_INVALID_INDEX.
 */
#    define PCC_CLOCK_NAME_MAPPINGS                                            \
        {                                                                      \
            PCC_INVALID_INDEX,      /*!< Core clock                      0  */ \
                PCC_INVALID_INDEX,  /*!< Bus clock                       1  */ \
                PCC_INVALID_INDEX,  /*!< Slow clock                      2  */ \
                PCC_INVALID_INDEX,  /*!< CLKOUT clock                    3  */ \
                PCC_INVALID_INDEX,  /*!< SIRC clock                      4  */ \
                PCC_INVALID_INDEX,  /*!< FIRC clock                      5  */ \
                PCC_INVALID_INDEX,  /*!< SOSC clock                      6  */ \
                PCC_INVALID_INDEX,  /*!< SPLL clock                      7  */ \
                PCC_INVALID_INDEX,  /*!< RTC_CLKIN clock                 8  */ \
                PCC_INVALID_INDEX,  /*!< SCG CLK_OUT clock               9  */ \
                PCC_INVALID_INDEX,  /*!< End of SCG clocks               10 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 11 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 12 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 13 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 14 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 15 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 16 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 17 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 18 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 19 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 20 */ \
                PCC_INVALID_INDEX,  /*!< FTM0 External Clock Pin Select  21 */ \
                PCC_INVALID_INDEX,  /*!< FTM1 External Clock Pin Select  22 */ \
                PCC_INVALID_INDEX,  /*!< FTM2 External Clock Pin Select  23 */ \
                PCC_INVALID_INDEX,  /*!< FTM3 External Clock Pin Select  24 */ \
                PCC_INVALID_INDEX,  /*!< CLKOUT Select                   25 */ \
                PCC_INVALID_INDEX,  /*!< CLK32K clock                    26 */ \
                PCC_INVALID_INDEX,  /*!< LPO clock                       27 */ \
                PCC_INVALID_INDEX,  /*!< LPO 1KHz clock                  28 */ \
                PCC_INVALID_INDEX,  /*!< LPO 32KHz clock                 29 */ \
                PCC_INVALID_INDEX,  /*!< LPO 128KHz clock                30 */ \
                PCC_INVALID_INDEX,  /*!< EIM clock source                31 */ \
                PCC_INVALID_INDEX,  /*!< ERM clock source                32 */ \
                PCC_INVALID_INDEX,  /*!< DMA clock source                33 */ \
                PCC_INVALID_INDEX,  /*!< MPU clock source                34 */ \
                PCC_INVALID_INDEX,  /*!< MSCM clock source               35 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 36 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 37 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 38 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 39 */ \
                PCC_INVALID_INDEX,  /*!< No clock entry in clock_names_t 40 */ \
                PCC_CMP0_INDEX,     /*!< CMP0 clock source               41 */ \
                PCC_CRC_INDEX,      /*!< CRC clock source                42 */ \
                PCC_DMAMUX_INDEX,   /*!< DMAMUX clock source             43 */ \
                PCC_EWM_INDEX,      /*!< EWM clock source                44 */ \
                PCC_PORTA_INDEX,    /*!< PORTA clock source              45 */ \
                PCC_PORTB_INDEX,    /*!< PORTB clock source              46 */ \
                PCC_PORTC_INDEX,    /*!< PORTC clock source              47 */ \
                PCC_PORTD_INDEX,    /*!< PORTD clock source              48 */ \
                PCC_PORTE_INDEX,    /*!< PORTE clock source              49 */ \
                PCC_RTC_INDEX,      /*!< RTC clock source                50 */ \
                PCC_SAI0_INDEX,     /*!< SAI0 clock source               51 */ \
                PCC_SAI1_INDEX,     /*!< SAI1 clock source               52 */ \
                PCC_INVALID_INDEX,  /*!< End of BUS clocks               53 */ \
                PCC_FlexCAN0_INDEX, /*!< FlexCAN0 clock source           54 */ \
                PCC_FlexCAN1_INDEX, /*!< FlexCAN1 clock source           55 */ \
                PCC_FlexCAN2_INDEX, /*!< FlexCAN2 clock source           56 */ \
                PCC_PDB0_INDEX,     /*!< PDB0 clock source               57 */ \
                PCC_PDB1_INDEX,     /*!< PDB1 clock source               58 */ \
                PCC_INVALID_INDEX,  /*!< End of SYS clocks               59 */ \
                PCC_FTFC_INDEX,     /*!< FTFC clock source               60 */ \
                PCC_INVALID_INDEX,  /*!< End of SLOW clocks              61 */ \
                PCC_ENET_INDEX,     /*!< ENET clock source               62 */ \
                PCC_FTM0_INDEX,     /*!< FTM0 clock source               63 */ \
                PCC_FTM1_INDEX,     /*!< FTM1 clock source               64 */ \
                PCC_FTM2_INDEX,     /*!< FTM2 clock source               65 */ \
                PCC_FTM3_INDEX,     /*!< FTM3 clock source               66 */ \
                PCC_FTM4_INDEX,     /*!< FTM4  clock source              67 */ \
                PCC_FTM5_INDEX,     /*!< FTM5  clock source              68 */ \
                PCC_FTM6_INDEX,     /*!< FTM6  clock source              69 */ \
                PCC_FTM7_INDEX,     /*!< FTM7 clock source               70 */ \
                PCC_INVALID_INDEX,  /*!< End of ASYNCH DIV1 clocks       71 */ \
                PCC_ADC0_INDEX,     /*!< ADC0 clock source               72 */ \
                PCC_ADC1_INDEX,     /*!< ADC1 clock source               73 */ \
                PCC_FlexIO_INDEX,   /*!< FLEXIO clock source             74 */ \
                PCC_LPI2C0_INDEX,   /*!< LPI2C0 clock source             75 */ \
                PCC_LPI2C1_INDEX,   /*!< LPI2C1 clock source             76 */ \
                PCC_LPIT_INDEX,     /*!< LPIT clock source               77 */ \
                PCC_LPSPI0_INDEX,   /*!< LPSPI0 clock source             78 */ \
                PCC_LPSPI1_INDEX,   /*!< LPSPI1 clock source             79 */ \
                PCC_LPSPI2_INDEX,   /*!< LPSPI2 clock source             80 */ \
                PCC_LPTMR0_INDEX,   /*!< LPTMR0 clock source             81 */ \
                PCC_LPUART0_INDEX,  /*!< LPUART0 clock source            82 */ \
                PCC_LPUART1_INDEX,  /*!< LPUART1 clock source            83 */ \
                PCC_LPUART2_INDEX,  /*!< LPUART2 clock source            84 */ \
                PCC_QSPI_INDEX,     /*!< QSPI clock source               85 */ \
                PCC_INVALID_INDEX,  /*!< End of ASYNCH DIV2 clocks       86 */ \
                PCC_INVALID_INDEX,  /*!< End of PCC clocks               87 */ \
        }

/* Time to wait for SIRC to stabilize (number of
 * cycles when core runs at maximum speed - 112 MHz */
#    define SIRC_STABILIZATION_TIMEOUT 26U;

