OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148_features.h
/* Time to wait for FIRC to stabilize (number of
 * cycles when core runs at maximum speed - 112 MHz */
#    define FIRC_STABILIZATION_TIMEOUT 10U;

/* Time to wait for SOSC to stabilize (number of
 * cycles when core runs at maximum speed - 112 MHz */
#    define SOSC_STABILIZATION_TIMEOUT 3205000U;

/* Time to wait for SPLL to stabilize (number of
 * cycles when core runs at maximum speed - 112 MHz */
#    define SPLL_STABILIZATION_TIMEOUT 1000U;

/*! @brief Maximum frequencies of core, bus and flash clocks.
 *  Each entry represents the maximum frequency of
 *  SYS_CLK (CORE_CLK), BUS_CLK, SLOW_CLK (FLASH_CLK)
 *  in VLPR, RUN and HSRUN modes.
 *
 *          SYS_CLK  BUS_CLK  SLOW_CLK
 *  VLPR       *        *         *
 *  RUN        *        *         *
 *  HSRUN      *        *         *
 */
#    define MAX_FREQ_VLPR 0U
#    define MAX_FREQ_RUN 1U
#    define MAX_FREQ_HSRUN 2U

#    define MAX_FREQ_SYS_CLK 0U
#    define MAX_FREQ_BUS_CLK 1U
#    define MAX_FREQ_SLOW_CLK 2U

#    define MAX_FREQ_MODES_NO 3U
#    define MAX_FREQ_CLK_NO 3U

#    define CLOCK_MAX_FREQUENCIES                                                       \
        {                                        /* SYS_CLK  BUS_CLK SLOW_CLK */        \
            {4000000, 4000000, 1000000},         /*!< MAX FREQ in low power modes */    \
                {80000000, 40000000, 26670000},  /*!< MAX FREQ in normal power modes */ \
                {112000000, 56000000, 28000000}, /*!< MAX FREQ in high speed modes */   \
        }

/*! @brief Temporary system clock source configurations.
 *         Each line represents the SYS(CORE), BUS and SLOW(FLASH) dividers
 *         for SIRC, FIRC, SOSC and SPLL clock sources.
 *
 *          SYS_CLK  BUS_CLK  SLOW_CLK
 *  SIRC       *        *         *
 *  FIRC       *        *         *
 *  SOSC       *        *         *
 *  SPLL       *        *         *
 */
#    define TMP_SIRC_CLK 0U
#    define TMP_FIRC_CLK 1U
#    define TMP_SOSC_CLK 2U
#    define TMP_SPLL_CLK 3U

#    define TMP_SYS_DIV 0U
#    define TMP_BUS_DIV 1U
#    define TMP_SLOW_DIV 2U

#    define TMP_SYS_CLK_NO 4U
#    define TMP_SYS_DIV_NO 3U

#    define TMP_SYSTEM_CLOCK_CONFIGS                                                    \
        { /*       SYS_CLK                    BUS_CLK                  SLOW_CLK      */ \
            {SCG_SYSTEM_CLOCK_DIV_BY_1,                                                 \
             SCG_SYSTEM_CLOCK_DIV_BY_1,                                                 \
             SCG_SYSTEM_CLOCK_DIV_BY_1}, /*!< Dividers for SIRC */                      \
                {SCG_SYSTEM_CLOCK_DIV_BY_1,                                             \
                 SCG_SYSTEM_CLOCK_DIV_BY_2,                                             \
                 SCG_SYSTEM_CLOCK_DIV_BY_4}, /*!< Dividers for FIRC */                  \
                {SCG_SYSTEM_CLOCK_DIV_BY_1,                                             \
                 SCG_SYSTEM_CLOCK_DIV_BY_2,                                             \
                 SCG_SYSTEM_CLOCK_DIV_BY_2}, /*!< Dividers for SOSC */                  \
                {SCG_SYSTEM_CLOCK_DIV_BY_3,                                             \
                 SCG_SYSTEM_CLOCK_DIV_BY_2,                                             \
                 SCG_SYSTEM_CLOCK_DIV_BY_2}, /*!< Dividers for SPLL */                  \
        }

/* Do not use the old names of the renamed symbols */
/* #define DO_NOT_USE_DEPRECATED_SYMBOLS */

/*! START !DO_NOT_USE_DEPRECATED_SYMBOLS
 *  These symbols have been renamed.
 *  The old names (deprecated symbols)
 *  are defined for backward compatibility.
 */
#    if !defined(DO_NOT_USE_DEPRECATED_SYMBOLS)
#        define CORE_CLOCK CORE_CLK
#        define BUS_CLOCK BUS_CLK
#        define SLOW_CLOCK SLOW_CLK
#        define CLKOUT_CLOCK CLKOUT_CLK
#        define SIRC_CLOCK SIRC_CLK
#        define FIRC_CLOCK FIRC_CLK
#        define SOSC_CLOCK SOSC_CLK
#        define SPLL_CLOCK SPLL_CLK
#        define RTC_CLKIN_CLOCK RTC_CLKIN_CLK
#        define SCG_CLKOUT_CLOCK SCG_CLKOUT_CLK
#        define SIM_RTCCLK_CLOCK SIM_RTCCLK_CLK
#        define SIM_LPO_CLOCK SIM_LPO_CLK
#        define SIM_LPO_1K_CLOCK SIM_LPO_1K_CLK
#        define SIM_LPO_32K_CLOCK SIM_LPO_32K_CLK
#        define SIM_LPO_128K_CLOCK SIM_LPO_128K_CLK
#        define SIM_EIM_CLOCK SIM_EIM_CLK
#        define SIM_ERM_CLOCK SIM_ERM_CLK
#        define SIM_DMA_CLOCK SIM_DMA_CLK
#        define SIM_MPU_CLOCK SIM_MPU_CLK
#        define SIM_MSCM_CLOCK SIM_MSCM_CLK
#        define PCC_DMAMUX0_CLOCK DMAMUX0_CLK
#        define PCC_CRC0_CLOCK CRC0_CLK
#        define PCC_RTC0_CLOCK RTC0_CLK
#        define PCC_PORTA_CLOCK PORTA_CLK
#        define PCC_PORTB_CLOCK PORTB_CLK
#        define PCC_PORTC_CLOCK PORTC_CLK
#        define PCC_PORTD_CLOCK PORTD_CLK
#        define PCC_PORTE_CLOCK PORTE_CLK
#        define PCC_EWM0_CLOCK EWM0_CLK
#        define PCC_CMP0_CLOCK CMP0_CLK
#        define PCC_FlexCAN0_CLOCK FlexCAN0_CLK
#        define PCC_FlexCAN1_CLOCK FlexCAN1_CLK
#        define PCC_FlexCAN2_CLOCK FlexCAN2_CLK
#        define PCC_PDB1_CLOCK PDB1_CLK
#        define PCC_PDB0_CLOCK PDB0_CLK
#        define PCC_FTFC0_CLOCK FTFC0_CLK
#        define PCC_FTM0_CLOCK FTM0_CLK
#        define PCC_FTM1_CLOCK FTM1_CLK
#        define PCC_FTM2_CLOCK FTM2_CLK
#        define PCC_FTM3_CLOCK FTM3_CLK
#        define PCC_ADC1_CLOCK ADC1_CLK
#        define PCC_LPSPI0_CLOCK LPSPI0_CLK
#        define PCC_LPSPI1_CLOCK LPSPI1_CLK
#        define PCC_LPSPI2_CLOCK LPSPI2_CLK
#        define PCC_LPIT0_CLOCK LPIT0_CLK
#        define PCC_ADC0_CLOCK ADC0_CLK
#        define PCC_LPTMR0_CLOCK LPTMR0_CLK
#        define PCC_FLEXIO0_CLOCK FLEXIO0_CLK
#        define PCC_LPI2C0_CLOCK LPI2C0_CLK
#        define PCC_LPUART0_CLOCK LPUART0_CLK
#        define PCC_LPUART1_CLOCK LPUART1_CLK
#        define PCC_LPUART2_CLOCK LPUART2_CLK
#    endif /* !DO_NOT_USE_DEPRECATED_SYMBOLS */

/* CSEc module features */

/*! @brief CSE_PRAM offset of the page length parameter used by the following
commands: CMD_ENC_ECB, CMD_ENC_CBC, CMD_DEC_ECB, CMD_DEC_CBC, CMD_MP_COMPRESS */
#    define FEATURE_CSEC_PAGE_LENGTH_OFFSET (0xEU)
/*! @brief CSE_PRAM offset of the message length parameter used by the following
commands: CMD_GENERATE_MAC, CMD_VERIFY_MAC (both copy and pointer methods) */
#    define FEATURE_CSEC_MESSAGE_LENGTH_OFFSET (0xCU)
/*! @brief CSE_PRAM offset of the MAC length parameter used by the following
commands: CMD_VERIFY_MAC (both copy and pointer methods) */
#    define FEATURE_CSEC_MAC_LENGTH_OFFSET (0x8U)
/*! @brief CSE_PRAM offset of the boot size parameter used by the following
commands: CMD_BOOT_DEFINE */
#    define FEATURE_CSEC_BOOT_SIZE_OFFSET (0x1CU)
/*! @brief CSE_PRAM offset of the boot flavor parameter used by the following
commands: CMD_BOOT_DEFINE */
#    define FEATURE_CSEC_BOOT_FLAVOR_OFFSET (0x1BU)
/*! @brief CSE_PRAM offset of the Flash start address parameter used by the
following commands: CMD_GENERATE_MAC, CMD_VERIFY_MAC (pointer method) */
#    define FEATURE_CSEC_FLASH_START_ADDRESS_OFFSET (0x10U)
/*! @brief CSE_PRAM offset of the verification status parameter used by the
following commands: CMD_VERIFY_MAC (both copy and pointer methods) */
#    define FEATURE_CSEC_VERIFICATION_STATUS_OFFSET (0x14U)
/*! @brief CSE_PRAM offset of the error bits field contained by all commands */
#    define FEATURE_CSEC_ERROR_BITS_OFFSET (0x4U)
/*! @brief CSE_PRAM offset of the SREG parameter used by the following commands:
CMD_GET_ID */
#    define FEATURE_CSEC_SREG_OFFSET (0x2FU)

/*! @brief CSE_PRAM offset of page 0 */
#    define FEATURE_CSEC_PAGE_0_OFFSET (0x0U)
/*! @brief CSE_PRAM offset of page 1 */
#    define FEATURE_CSEC_PAGE_1_OFFSET (0x10U)
/*! @brief CSE_PRAM offset of page 2 */
#    define FEATURE_CSEC_PAGE_2_OFFSET (0x20U)
/*! @brief CSE_PRAM offset of page 3 */
#    define FEATURE_CSEC_PAGE_3_OFFSET (0x30U)
/*! @brief CSE_PRAM offset of page 4 */
#    define FEATURE_CSEC_PAGE_4_OFFSET (0x40U)
/*! @brief CSE_PRAM offset of page 5 */
#    define FEATURE_CSEC_PAGE_5_OFFSET (0x50U)
/*! @brief CSE_PRAM offset of page 6 */
#    define FEATURE_CSEC_PAGE_6_OFFSET (0x60U)
/*! @brief CSE_PRAM offset of page 7 */
#    define FEATURE_CSEC_PAGE_7_OFFSET (0x70U)

/* ADC module features */

/*! @brief ADC feature flag for extended number of SC1 and R registers,
 * generically named 'alias registers' */
/* TODO: for S32K148_100_BGA this feature must be disabled. */
#    define FEATURE_ADC_HAS_EXTRA_NUM_REGS (1)

/*! @brief ADC number of control channels */
#    if FEATURE_ADC_HAS_EXTRA_NUM_REGS
#        define ADC_CTRL_CHANS_COUNT ADC_aSC1_COUNT
#    else
#        define ADC_CTRL_CHANS_COUNT ADC_SC1_COUNT
#    endif /* FEATURE_ADC_HAS_EXTRA_NUM_REGS */

