OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148_features.h
/*! @brief ADC default Sample Time from RM */
#    define ADC_DEFAULT_SAMPLE_TIME (0x0CU)
/*! @brief ADC default User Gain from RM */
#    define ADC_DEFAULT_USER_GAIN (0x04U)

/* MSCM module features */

/* @brief Has interrupt router control registers (IRSPRCn). */
#    define FEATURE_MSCM_HAS_INTERRUPT_ROUTER (0)
/* @brief Has directed CPU interrupt routerregisters (IRCPxxx). */
#    define FEATURE_MSCM_HAS_CPU_INTERRUPT_ROUTER (0)

/* SAI module features */
#    define SAI0_CHANNEL_COUNT 4U
#    define SAI1_CHANNEL_COUNT 1U
#    define SAI_MAX_CHANNEL_COUNT 4U

/* ENET module features */

/*! @brief ENET peripheral clock names */
#    define FEATURE_ENET_CLOCK_NAMES \
        {                            \
            CORE_CLK                 \
        }

/*! @brief The transmission interrupts */
#    define FEATURE_ENET_TX_IRQS ENET_TX_IRQS
/*! @brief The reception interrupts */
#    define FEATURE_ENET_RX_IRQS ENET_RX_IRQS
/*! @brief The error interrupts */
#    define FEATURE_ENET_ERR_IRQS ENET_ERR_IRQS
/*! @brief The wakeup interrupts */
#    define FEATURE_ENET_WAKE_IRQS ENET_WAKE_IRQS

/*! @brief The offset of the counters region relative to the base address, in words. */
#    define FEATURE_ENET_COUNTERS_OFFSET_WORDS 0x80

/*! @brief The maximum supported frequency for MDC, in Hz. */
#    define FEATURE_ENET_MDC_MAX_FREQUENCY 2500000U

/*! @brief Minimum hold time on the MDIO output, in nanoseconds. */
#    define FEATURE_ENET_MDIO_MIN_HOLD_TIME_NS 10U

/*! @brief Has AVB (Audio Video Bridging, IEEE 802.1Qav) related features. */
#    define FEATURE_ENET_HAS_AVB (0)

/*! @brief Has receive frame parser feature. */
#    define FEATURE_ENET_HAS_RECEIVE_PARSER (0)

/* QuadSPI module features */

/*! @brief First address of QuadSPI Rx Buffer on system memory map. */
#    define FEATURE_QSPI_ARDB_BASE 0x67000000U
/*! @brief Last address of QuadSPI Rx Buffer on system memory map. */
#    define FEATURE_QSPI_ARDB_END 0x67FFFFFFU
/*! @brief First address of the serial flash device on the AHB bus. */
#    define FEATURE_QSPI_AMBA_BASE 0x68000000U
/*! @brief Last address of the serial flash device on the AHB bus. */
#    define FEATURE_QSPI_AMBA_END 0x6FFFFFFFU
/*! @brief Size of AHB buffer. */
#    define FEATURE_QSPI_AHB_BUF_SIZE 1024U

/*! @brief List of DMA Tx requests */
#    define FEATURE_QSPI_DMA_TX_REQ \
        {                           \
            EDMA_REQ_QUADSPI_TX     \
        }
/*! @brief List of DMA Rx requests */
#    define FEATURE_QSPI_DMA_RX_REQ \
        {                           \
            EDMA_REQ_QUADSPI_RX     \
        }

/* OSIF module features */

#    define FEATURE_OSIF_USE_SYSTICK (1)
#    define FEATURE_OSIF_FREERTOS_ISR_CONTEXT_METHOD (1) /* Cortex M device */

/* TRGMUX module features */

#    define FEATURE_TRGMUX_HAS_EXTENDED_NUM_TRIGS (1)

#endif /* S32K148_FEATURES_H */

/*******************************************************************************
 * EOF
 ******************************************************************************/
